#+TITLE: calc examples
# #+DATE: <2013-08-09 Fri>
#+AUTHOR: Derek Feichtinger
#+EMAIL: derek.feichtinger@psi.ch
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not LOGBOOK) date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.3.1 (Org mode 8.0.7)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

# By default I do not want that source code blocks are evaluated on export. Usually
# I want to evaluate them interactively and retain the original results.
#+PROPERTY: header-args :eval never-export

* Version information
  #+BEGIN_SRC emacs-lisp :results output :exports both
    (princ (concat (format "Emacs version: %s\n" (emacs-version))
                   (format "org version: %s\n" (org-version))))
    
  #+END_SRC

  #+RESULTS:
  : Emacs version: GNU Emacs 24.5.1 (x86_64-unknown-linux-gnu, GTK+ Version 3.10.8)
  :  of 2015-05-04 on dflt1w
  : org version: 8.3.2

* babel calc

  Not too useful, yet. Embedded calc certainly is better for
  inlining math in documents. Using Elisp to directly interacting with
  calc also is more powerful.

  #+BEGIN_SRC calc
24
3
'/
  #+END_SRC

  #+RESULTS:
  : 8


  - solving an equation
    #+BEGIN_SRC calc :exports both
fsolve(x*2+x=4,x)
#+END_SRC

    #+RESULTS:
    : x = 1.33333333333

  
  - solving a linear system of equations
    #+BEGIN_SRC calc
  fsolve([x + y = a, x - y = b],[x,y])
    #+END_SRC

    #+RESULTS:
    : [x = a + (b - a) / 2, y = (a - b) / 2]

** basic use of calc-eval
   The variables in formulas are replaced by the additional arguments. Arguments can be given as string or number.
   #+BEGIN_SRC emacs-lisp :results output
     (print (calc-eval "2^$1 - 1" nil 128))
     (print (calc-eval "$1 < $2" 'pred "4000" "5000"))
     (print (calc-eval "nextprime($1)" nil "100000000000000000"))

     ;; radix can be chosen by separating radix by # from number
     (print (calc-eval "16#deadbeef"))
     (print (calc-eval "2#1111"))
   #+END_SRC

   #+RESULTS:
   #+begin_example

   "340282366920938463463374607431768211455"

   t

   "100000000000000003"

   "3735928559"

   "15"
#+end_example

   The second argument serves as a separator if the input string parses to a list of expressions. By default the list
   is printed comma-separated.
   #+BEGIN_SRC emacs-lisp :results output
     (print (calc-eval "10+5,7*3,5/2"))
     (print (calc-eval "10+5,7*3,5/2" ";"))
     (print (calc-eval "10+5,7*3,5/2" "___"))
   #+END_SRC

   #+RESULTS:
   : 
   : "15, 21, 2.5"
   : 
   : "15;21;2.5"
   : 
   : "15___21___2.5"

 
** Stack operations: push, pop and top

   - =push= pushes the element onto the stack
   - =pop= deletes as many elements from the stack as the preceding integer argument indicates
     - =0 pop= is convenient for finding out the size of the stack
   - =top= retrieves the value at the indicated position of the stack
   #+BEGIN_SRC emacs-lisp :results output :exports both
     (princ (format "Size of the stack: %s\n" (calc-eval 0 'pop)))
     (calc-eval "10 ft" 'push)
     (calc-eval "20 ft" 'push)
     (calc-eval "30 ft" 'push)
     (princ (format "After 3*push: Size of the stack: %s (top element: %s)\n"
                    (calc-eval 0 'pop)
                    (calc-eval 1 'top)))
     (princ (format "element on second level of stack: %s\n" (calc-eval 2 'top)))
     (calc-eval 2 'pop)
     (princ (format "After 3*push: Size of the stack: %s (top element: %s)\n"
                    (calc-eval 0 'pop)
                    (calc-eval 1 'top)))
     (calc-eval 1 'pop)
   #+END_SRC

   #+RESULTS:
   : Size of the stack: 5
   : After 3*push: Size of the stack: 8 (top element: 30 ft)
   : element on second level of stack: 20 ft
   : After 3*push: Size of the stack: 6 (top element: 10 ft)

** raw calc objects as input to functions

   calc internal functions deal with /raw/ calc objects. These can also be obtained through =calc-eval= by
   passing the =raw= as the second argument. 
   #+BEGIN_SRC emacs-lisp
     (calc-eval (math-convert-units (calc-eval "10 m" 'raw)
                                    (calc-eval "ft" 'raw)))
   #+END_SRC

   #+RESULTS:
   : 32.8083989501 ft

